export const inHouse = [
  {
    id: 0,
    name: "ฟันน้ำนม",
    age: "0",
    title: "ฟันน้ำนมความสูง ไม่เกิน 140 ซม",
  },
  {
    id: 1,
    name: "ฟันน้ำนม",
    age: "0",
    title: "ฟันน้ำนมความสูง เกิน 140 ซม",
  },
  {
    id: 2,
    name: "ฟันแท้ 1 คู่",
    age: "0",
    title: "ฟันแท้ ไม่เกิน 1 คู่",
  },
  {
    id: 3,
    name: "ฟันแท้ 1 - 2 คู่",
    age: "0",
    title: "ฟันแท้ ไม่เกิน 2 คู่",
  },
  {
    id: 4,
    name: "ฟันแท้ 1 - 3 คู่",
    age: "0",
    title: "ฟันแท้ ไม่เกิน 3 คู่",
  },
];
