// export const inHouse = [
//   {
//     id: 0,
//     name: "ฟันน้ำนม",
//     age: "0",
//     title: "ฟันน้ำนมความสูง ไม่เกิน 140 ซม",
//   },
//   {
//     id: 1,
//     name: "ฟันน้ำนม",
//     age: "0",
//     title: "ฟันน้ำนมความสูง เกิน 140 ซม",
//   },
//   {
//     id: 2,
//     name: "ฟันแท้ 1 คู่",
//     age: "0",
//     title: "ฟันแท้ ไม่เกิน 1 คู่",
//   },
//   {
//     id: 3,
//     name: "ฟันแท้ 1 - 2 คู่",
//     age: "0",
//     title: "ฟันแท้ ไม่เกิน 2 คู่",
//   },
//   {
//     id: 4,
//     name: "ฟันแท้ 1 - 3 คู่",
//     age: "0",
//     title: "ฟันแท้ ไม่เกิน 3 คู่",
//   },
// ];

export const inHouse = [
  {
    id: 0,
    age: "0",
    title: "ลูกควาย รุ่นฟันน้ำนม ส่วนสูงไม่เกิน  ๑๔๐ เซนติเมตร",
  },
  {
    id: 1,
    age: "0",
    title: "ลูกควาย รุ่นฟันน้ำนม ส่วนสูงเกิน  ๑๔๐  เซนติเมตร",
  },
  {
    id: 2,
    age: "0",
    title: "ควายรุ่น  รุ่นนฟันแท้ ๑ คู่",
  },
  {
    id: 3,
    age: "0",
    title: "ควายหนุ่ม-สาว รุ่นฟันแท้ ๒ คู่",
  },
  {
    id: 4,
    age: "0",
    title: "ควายโตเต็มวัย รุ่นฟันแท้ ๓  คู่",
  },
  {
    id: 5,
    age: "0",
    title: "ลูกควาย รุ่นฟันน้ำนม (ไฮบริด รวมสี)",
  },
  {
    id: 6,
    age: "0",
    title: "ควายรุ่น ฟันฟันแท้ ๑ - ๓ คู่ (ไฮบริด รวมสี)",
  },
  {
    id: 6,
    age: "0",
    title: "ควายรุ่น รุ่นพ่อพันธุ์  แม่พันธุ์ (ควายแคระ)",
  },
];
