export const rules = [
  "สัตว์ที่เข้าประกวดต้องมีใบพันธุ์ประวัติที่ออกโดยกรมปศุสัตว์ หรือสมาคมที่เกี่ยวข้อง",
  "สัตว์ที่เข้าประกวดทุกตัว ต้องมีประวัติการได้รับวัคซีน โรคปากเท้าเปื่อย (FMD) โรคแท้งติดต่อ (Burcellosis) โรคคอบวม (Haemorrhagic Septicemia)",
  "ห้ามกรอกอาหารให้กับสัตว์บริเวณที่ประกวด (ถือเป็นการทารุณกรรมสัตว์)",
  "ห้ามใช้สารเร่งเนื้อแดง",
  "ผู้จูงสัตว์ควรแต่งกายสุภาพ",
  "สัตว์ที่ประกวดได้ที่ 1 - 3 จะต้องตรวจเลือด เพื่อทดสอบโรคทางระบบสืบพันธุ์, ใช้สารเร่งเนื้อแดง, และตรวจหาโครโมโซมควายปลักไทย",
  "สัตว์ที่ได้รับรางวัลแกรนด์แชมป์ต้องตรวจเลือด เพื่อทดสอบโรคทางระบบสืบพันธุ์, ใช้สารเร่งเนื้อแดง, และตรวจหาโครโมโซมควายปลักไทย",
];
